In [5]:
import pandas as pd

In [7]:
# هنطبق كل خطوات ال Analysis
# 1- Ask Questions
# 2- Explore
# 3- Cleaning and transformation
# 4- Reporting

In [9]:
#Explore
# head , tail , sample
# info
# describe
# shape
# columns
# dtypes

#unique
#value_counts
#nunique

In [8]:
import pandas as pd
import csv

# Path to your file
file_path = 'HumanResources.csv'

# Step 1: Open the file and read a sample
with open(file_path, 'r', encoding='utf-8') as f:
    sample = f.read(2048)
    sniffer = csv.Sniffer()
    dialect = sniffer.sniff(sample)

# Step 2: Use the detected delimiter
df = pd.read_csv(file_path, delimiter=dialect.delimiter)

print(f"Detected delimiter: {repr(dialect.delimiter)}")
print(df.head())

Detected delimiter: ';'
   Employee_ID First Name Last Name  Gender           State           City  \
0  00-95822412   Danielle   Johnson  Female        New York  New York City
1  00-42868828       John    Taylor    Male  North Carolina      Charlotte
2  00-83197857      Erica   Mcclain    Male        New York  New York City
3  00-13999315   Brittany   Johnson    Male        New York  New York City
4  00-90801586    Jeffery    Wagner  Female        New York  New York City

  Education Level   Birthdate    Hiredate    Termdate        Department  \
0     High School  13/02/1980  16/04/2016  05/07/2021  Customer Service
1        Bachelor  22/09/1987  09/02/2017  14/06/2019                IT
2        Bachelor  19/05/1994  03/02/2016  06/03/2021        Operations
3        Bachelor  18/04/1980  06/02/2016  06/11/2018        Operations
4        Bachelor  07/04/1985  11/01/2015         NaN        Operations

               Job Title  Salary Performance Rating
0   Help Desk Technician   81552  Needs Improvement
1   System Administrator  107520               Good
2  Logistics Coordinator   61104               Good
3   Inventory Specialist   73770               Good
4     Operations Analyst   55581       Satisfactory

In [9]:
df

,Employee_ID,First Name,Last Name,Gender,State,City,Education Level,Birthdate,Hiredate,Termdate,Department,Job Title,Salary,Performance Rating
0,00-95822412,Danielle,Johnson,Female,New York,New York City,High School,13/02/1980,16/04/2016,05/07/2021,Customer Service,Help Desk Technician,81552,Needs Improvement
1,00-42868828,John,Taylor,Male,North Carolina,Charlotte,Bachelor,22/09/1987,09/02/2017,14/06/2019,IT,System Administrator,107520,Good
2,00-83197857,Erica,Mcclain,Male,New York,New York City,Bachelor,19/05/1994,03/02/2016,06/03/2021,Operations,Logistics Coordinator,61104,Good
3,00-13999315,Brittany,Johnson,Male,New York,New York City,Bachelor,18/04/1980,06/02/2016,06/11/2018,Operations,Inventory Specialist,73770,Good
4,00-90801586,Jeffery,Wagner,Female,New York,New York City,Bachelor,07/04/1985,11/01/2015,NaN,Operations,Operations Analyst,55581,Satisfactory
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8945,00-29226627,Cory,Mccall,Male,New York,Buffalo,Bachelor,28/07/1969,29/05/2021,NaN,Operations,Inventory Specialist,64265,Needs Improvement
8946,00-15091628,Brian,Nguyen,Male,New York,New York City,Bachelor,22/05/1984,06/07/2022,NaN,Operations,Inventory Specialist,63570,Excellent
8947,00-68025539,Corey,Miles,Female,Michigan,Detroit,High School,05/08/2001,03/02/2018,NaN,HR,Recruiter,73208,Needs Improvement
8948,00-19066901,Krystal,Wilson,Male,North Carolina,Raleigh,Bachelor,23/09/1962,07/12/2023,NaN,Finance,Accountant,95028,Good
8949,00-50413766,Derek,Thornton,Female,New York,Rochester,PhD,04/08/1993,15/08/2017,NaN,Sales,Sales Specialist,68351,Good

In [10]:
df.dtypes

Employee_ID           object
First Name            object
Last Name             object
Gender                object
State                 object
City                  object
Education Level       object
Birthdate             object
Hiredate              object
Termdate              object
Department            object
Job Title             object
Salary                 int64
Performance Rating    object
dtype: object

In [11]:
df['Birthdate'] = pd.to_datetime(df['Birthdate'],dayfirst = True)

In [12]:
df.dtypes

Employee_ID                   object
First Name                    object
Last Name                     object
Gender                        object
State                         object
City                          object
Education Level               object
Birthdate             datetime64[ns]
Hiredate                      object
Termdate                      object
Department                    object
Job Title                     object
Salary                         int64
Performance Rating            object
dtype: object

In [13]:
df['Hiredate'] = pd.to_datetime(df['Hiredate'],dayfirst =True)

In [14]:
df['Termdate'] = pd.to_datetime(df['Termdate'],dayfirst = True)

In [15]:
df.dtypes

Employee_ID                   object
First Name                    object
Last Name                     object
Gender                        object
State                         object
City                          object
Education Level               object
Birthdate             datetime64[ns]
Hiredate              datetime64[ns]
Termdate              datetime64[ns]
Department                    object
Job Title                     object
Salary                         int64
Performance Rating            object
dtype: object

In [16]:
df.duplicated().sum()

np.int64(0)

In [17]:
df.isna().sum()

Employee_ID              0
First Name               0
Last Name                0
Gender                   0
State                    0
City                     0
Education Level          0
Birthdate                0
Hiredate                 0
Termdate              7984
Department               0
Job Title                0
Salary                   0
Performance Rating       0
dtype: int64

In [57]:
df.sample()

,Employee_ID,First Name,Last Name,Gender,State,City,Education Level,Birthdate,Hiredate,Termdate,Department,Job Title,Salary,Performance Rating
759,00-76545476,Shawn,Palmer,Male,New York,New York City,Bachelor,1962-07-19,2020-06-26,2021-08-20,HR,HR Coordinator,72109,Good

In [18]:
df.describe().T

,count,mean,min,25%,50%,75%,max,std
Birthdate,8950,1984-01-27 03:38:19.977653632,1959-05-26 00:00:00,1975-06-08 00:00:00,1984-06-05 12:00:00,1993-04-28 18:00:00,2004-05-23 00:00:00,NaN
Hiredate,8950,2020-02-18 20:28:44.782123008,2015-01-01 00:00:00,2017-08-26 00:00:00,2019-12-13 12:00:00,2022-10-17 00:00:00,2024-12-29 00:00:00,NaN
Termdate,966,2021-08-06 22:00:44.720496896,2015-10-13 00:00:00,2019-08-30 18:00:00,2021-09-21 12:00:00,2023-05-30 00:00:00,2024-12-27 00:00:00,NaN
Salary,8950.0,70964.21352,51835.0,60920.5,66592.5,78600.5,149377.0,13763.126237

In [59]:
df.columns

Index(['Employee_ID', 'First Name', 'Last Name', 'Gender', 'State', 'City',
       'Education Level', 'Birthdate', 'Hiredate', 'Termdate', 'Department',
       'Job Title', 'Salary', 'Performance Rating'],
      dtype='object')

In [60]:
df['Termdate']

0      2021-07-05
1      2019-06-14
2      2021-03-06
3      2018-11-06
4             NaT
          ...
8945          NaT
8946          NaT
8947          NaT
8948          NaT
8949          NaT
Name: Termdate, Length: 8950, dtype: datetime64[ns]

In [21]:
df.isna().sum()

Employee_ID           0
First Name            0
Last Name             0
Gender                0
State                 0
City                  0
Education Level       0
Birthdate             0
Hiredate              0
Termdate              0
Department            0
Job Title             0
Salary                0
Performance Rating    0
dtype: int64

In [22]:
df.dtypes

Employee_ID                   object
First Name                    object
Last Name                     object
Gender                        object
State                         object
City                          object
Education Level               object
Birthdate             datetime64[ns]
Hiredate              datetime64[ns]
Termdate                      object
Department                    object
Job Title                     object
Salary                         int64
Performance Rating            object
dtype: object

In [95]:
df.tail(10)

,Employee_ID,First Name,Last Name,Gender,State,City,Education Level,Birthdate,Hiredate,Termdate,Department,Job Title,Salary,Performance Rating
8940,00-73977067,Mark,Spencer,Female,New York,Buffalo,Bachelor,1979-01-22,2023-12-11,2056,Operations,Logistics Coordinator,63864,Excellent
8941,00-43446562,Eric,Brown,Female,New York,New York City,Bachelor,1994-12-31,2023-05-04,2056,Operations,Logistics Coordinator,55987,Good
8942,00-32657392,James,Coleman,Female,New York,Rochester,High School,1967-09-26,2017-09-28,2056,Marketing,SEO Specialist,77404,Good
8943,00-50425690,Timothy,Joyce,Female,New York,Rochester,Bachelor,1979-04-18,2019-02-07,2056,Customer Service,Customer Service Representative,57382,Satisfactory
8944,00-53546572,Todd,Crosby,Female,New York,Rochester,Master,1988-04-23,2015-08-18,2056,IT,Software Developer,95920,Good
8945,00-29226627,Cory,Mccall,Male,New York,Buffalo,Bachelor,1969-07-28,2021-05-29,2056,Operations,Inventory Specialist,64265,Needs Improvement
8946,00-15091628,Brian,Nguyen,Male,New York,New York City,Bachelor,1984-05-22,2022-07-06,2056,Operations,Inventory Specialist,63570,Excellent
8947,00-68025539,Corey,Miles,Female,Michigan,Detroit,High School,2001-08-05,2018-02-03,2056,HR,Recruiter,73208,Needs Improvement
8948,00-19066901,Krystal,Wilson,Male,North Carolina,Raleigh,Bachelor,1962-09-23,2023-12-07,2056,Finance,Accountant,95028,Good
8949,00-50413766,Derek,Thornton,Female,New York,Rochester,PhD,1993-08-04,2017-08-15,2056,Sales,Sales Specialist,68351,Good

In [23]:
df['Termdate'] = pd.to_datetime(df['Termdate'])

In [24]:
df.dtypes

Employee_ID                   object
First Name                    object
Last Name                     object
Gender                        object
State                         object
City                          object
Education Level               object
Birthdate             datetime64[ns]
Hiredate              datetime64[ns]
Termdate              datetime64[ns]
Department                    object
Job Title                     object
Salary                         int64
Performance Rating            object
dtype: object

In [25]:
df.tail()

,Employee_ID,First Name,Last Name,Gender,State,City,Education Level,Birthdate,Hiredate,Termdate,Department,Job Title,Salary,Performance Rating
8945,00-29226627,Cory,Mccall,Male,New York,Buffalo,Bachelor,1969-07-28,2021-05-29,1970-01-01 00:00:00.000002056,Operations,Inventory Specialist,64265,Needs Improvement
8946,00-15091628,Brian,Nguyen,Male,New York,New York City,Bachelor,1984-05-22,2022-07-06,1970-01-01 00:00:00.000002056,Operations,Inventory Specialist,63570,Excellent
8947,00-68025539,Corey,Miles,Female,Michigan,Detroit,High School,2001-08-05,2018-02-03,1970-01-01 00:00:00.000002056,HR,Recruiter,73208,Needs Improvement
8948,00-19066901,Krystal,Wilson,Male,North Carolina,Raleigh,Bachelor,1962-09-23,2023-12-07,1970-01-01 00:00:00.000002056,Finance,Accountant,95028,Good
8949,00-50413766,Derek,Thornton,Female,New York,Rochester,PhD,1993-08-04,2017-08-15,1970-01-01 00:00:00.000002056,Sales,Sales Specialist,68351,Good

In [26]:
df['Termdate'] = df['Termdate'].replace(
    pd.Timestamp('1970-01-01 00:00:00.000002056'), 
    pd.Timestamp('2099-12-31'))

In [27]:
df['Termdate']

0      2021-07-05
1      2019-06-14
2      2021-03-06
3      2018-11-06
4      2099-12-31
          ...
8945   2099-12-31
8946   2099-12-31
8947   2099-12-31
8948   2099-12-31
8949   2099-12-31
Name: Termdate, Length: 8950, dtype: datetime64[ns]

In [105]:
df.columns

Index(['Employee_ID', 'First Name', 'Last Name', 'Gender', 'State', 'City',
       'Education Level', 'Birthdate', 'Hiredate', 'Termdate', 'Department',
       'Job Title', 'Salary', 'Performance Rating'],
      dtype='object')

In [30]:
df.duplicated().sum()

np.int64(0)

In [28]:
df['Department']

0       Customer Service
1                     IT
2             Operations
3             Operations
4             Operations
              ...
8945          Operations
8946          Operations
8947                  HR
8948             Finance
8949               Sales
Name: Department, Length: 8950, dtype: object

In [115]:
df['Education Level'].unique()

array(['High School', 'Bachelor', 'PhD', 'Master'], dtype=object)

Reporting

In [125]:
total_employees = df['Employee_ID'].nunique()

In [126]:
total_employees

8950

In [129]:

df.groupby(['Education Level','Gender'])['Employee_ID'].count()

Education Level  Gender
Bachelor         Female    2489
                 Male      2927
High School      Female     855
                 Male       964
Master           Female     572
                 Male       665
PhD              Female     233
                 Male       245
Name: Employee_ID, dtype: int64

In [63]:
df.columns

Index(['Employee_ID', 'First Name', 'Last Name', 'Gender', 'State', 'City',
       'Education Level', 'Birthdate', 'Hiredate', 'Termdate', 'Department',
       'Job Title', 'Salary', 'Performance Rating', 'Age', 'experience'],
      dtype='object')

In [51]:
#average age for employess
from datetime import datetime
reference_Time = (pd.Timestamp('2025-07-25'))

In [52]:
df['Age'] = (reference_Time - df['Birthdate']).dt.days // 365

df[['Age','Birthdate']]

      Age  Birthdate
0      45 1980-02-13
1      37 1987-09-22
2      31 1994-05-19
3      45 1980-04-18
4      40 1985-04-07
...   ...        ...
8945   56 1969-07-28
8946   41 1984-05-22
8947   23 2001-08-05
8948   62 1962-09-23
8949   31 1993-08-04

[8950 rows x 2 columns]

In [55]:
df['Age'].mean()

np.float64(41.017877094972064)

In [56]:
df['experience'] = (reference_Time - df['Hiredate']).dt.days//365

In [59]:
df['experience'].mean()

np.float64(4.936983240223464)

In [60]:
df['Salary'].sum()

np.int64(635129711)

In [64]:
df.groupby(['Department','Job Title'])['Salary'].sum()

Department        Job Title
Customer Service  Customer Service Manager            6273917
                  Customer Service Representative    30947951
                  Help Desk Technician               35343927
                  Support Specialist                 37580725
Finance           Accountant                         12708115
                  Accounts Payable Specialist         6809609
                  Finance Manager                     1126287
                  Financial Analyst                  13911906
HR                HR Assistant                        1819339
                  HR Coordinator                      3521277
                  HR Manager                            82203
                  Recruiter                           5610127
IT                IT Manager                          3189391
                  IT Support Specialist              27530500
                  Software Developer                 58570593
                  System Administrator               23930706
Marketing         Content Creator                    18864783
                  Marketing Coordinator              14109139
                  Marketing Manager                   2782718
                  SEO Specialist                     12822539
Operations        Inventory Specialist               64342536
                  Logistics Coordinator              66949972
                  Operations Analyst                 41036891
                  Operations Manager                  5428481
Sales             Sales Consultant                   41144089
                  Sales Manager                       5397366
                  Sales Representative               50894096
                  Sales Specialist                   42400528
Name: Salary, dtype: int64

In [73]:
df.groupby('Gender').agg({
    'Age':'mean',
    'experience':'mean'
})

              Age  experience
Gender
Female  41.211135    4.921427
Male    40.850864    4.950427

In [94]:
df['Performance Rating'] = df['Performance Rating'].astype(str)

In [95]:
df.dtypes

Employee_ID                   object
First Name                    object
Last Name                     object
Gender                        object
State                         object
City                          object
Education Level               object
Birthdate             datetime64[ns]
Hiredate              datetime64[ns]
Termdate              datetime64[ns]
Department                    object
Job Title                     object
Salary                         int64
Performance Rating            object
Age                            int64
experience                     int64
dtype: object

In [96]:
df['Performance Rating'].head()

0    nan
1    nan
2    nan
3    nan
4    nan
Name: Performance Rating, dtype: object

In [97]:

df.isna().sum()

Employee_ID           0
First Name            0
Last Name             0
Gender                0
State                 0
City                  0
Education Level       0
Birthdate             0
Hiredate              0
Termdate              0
Department            0
Job Title             0
Salary                0
Performance Rating    0
Age                   0
experience            0
dtype: int64

In [118]:
df.sample()

,Employee_ID,First Name,Last Name,Gender,State,City,Education Level,Birthdate,Hiredate,Termdate,Department,Job Title,Salary,Performance Rating,Age,experience
2981,00-28703143,Janice,Bolton,Male,New York,Buffalo,High School,1975-12-19,2017-11-29,2099-12-31,Marketing,SEO Specialist,57419,nan,49,7

In [120]:
df = df.drop('Performance Rating',axis=  1)

In [121]:
df

,Employee_ID,First Name,Last Name,Gender,State,City,Education Level,Birthdate,Hiredate,Termdate,Department,Job Title,Salary,Age,experience
0,00-95822412,Danielle,Johnson,Female,New York,New York City,High School,1980-02-13,2016-04-16,2021-07-05,Customer Service,Help Desk Technician,81552,45,9
1,00-42868828,John,Taylor,Male,North Carolina,Charlotte,Bachelor,1987-09-22,2017-02-09,2019-06-14,IT,System Administrator,107520,37,8
2,00-83197857,Erica,Mcclain,Male,New York,New York City,Bachelor,1994-05-19,2016-02-03,2021-03-06,Operations,Logistics Coordinator,61104,31,9
3,00-13999315,Brittany,Johnson,Male,New York,New York City,Bachelor,1980-04-18,2016-02-06,2018-11-06,Operations,Inventory Specialist,73770,45,9
4,00-90801586,Jeffery,Wagner,Female,New York,New York City,Bachelor,1985-04-07,2015-01-11,2099-12-31,Operations,Operations Analyst,55581,40,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8945,00-29226627,Cory,Mccall,Male,New York,Buffalo,Bachelor,1969-07-28,2021-05-29,2099-12-31,Operations,Inventory Specialist,64265,56,4
8946,00-15091628,Brian,Nguyen,Male,New York,New York City,Bachelor,1984-05-22,2022-07-06,2099-12-31,Operations,Inventory Specialist,63570,41,3
8947,00-68025539,Corey,Miles,Female,Michigan,Detroit,High School,2001-08-05,2018-02-03,2099-12-31,HR,Recruiter,73208,23,7
8948,00-19066901,Krystal,Wilson,Male,North Carolina,Raleigh,Bachelor,1962-09-23,2023-12-07,2099-12-31,Finance,Accountant,95028,62,1
8949,00-50413766,Derek,Thornton,Female,New York,Rochester,PhD,1993-08-04,2017-08-15,2099-12-31,Sales,Sales Specialist,68351,31,7